Autodesk.Revit.DB.FamilyInstanceReferenceType
Since:
2018
Corresponds to the possible values of parameter "Is Reference" of reference planes and parameter "Reference" of reference lines in families.
This enum is used to identify references of family instances corresponding to reference planes and reference lines in the family.
Since:
2018

Autodesk.Revit.DB.FamilyInstanceReferenceType.NotAReference
This value is returned from FamilyInstance::getReferenceType if the reference does not correspond to any reference plane
or reference line in the family.

Autodesk.Revit.DB.FamilyInstanceReferenceType.WeakReference
Reference plane whose "Is Reference" parameter is set to "Weak Reference", or reference line whose "Reference" parameter is set to "Weak Reference".
There may be multiple such reference planes and lines in the family.
These references are not stable: if there is a dimension to such reference, and the instance's family is replaced,
the dimension is not guaranteed to survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.StrongReference
Reference plane whose "Is Reference" parameter is set to "Strong Reference", or reference line whose "Reference" parameter is set to "Strong Reference".
There may be multiple such reference planes and lines in the family.
These references are not stable: if there is a dimension to such reference, and the instance's family is replaced,
the dimension is not guaranteed to survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Top
Reference plane whose "Is Reference" parameter is set to "Top".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.CenterElevation
Reference plane whose "Is Reference" parameter is set to "Center (Elevation)".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Bottom
Reference plane whose "Is Reference" parameter is set to "Bottom".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Back
Reference plane whose "Is Reference" parameter is set to "Back".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.CenterFrontBack
Reference plane whose "Is Reference" parameter is set to "Center (Front/Back)".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Front
Reference plane whose "Is Reference" parameter is set to "Front".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Right
Reference plane whose "Is Reference" parameter is set to "Right".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.CenterLeftRight
Reference plane whose "Is Reference" parameter is set to "Center (Left/Right)".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.

Autodesk.Revit.DB.FamilyInstanceReferenceType.Left
Reference plane whose "Is Reference" parameter is set to "Left".  There may be no more than one such reference plane in the family.
This reference is stable: if there is a dimension to this reference of an instance, and the instance's type or family is replaced,
the dimension will survive.